backend/traits/EnforceProjectContextTrait.php

SELECT * FROM `empresa` WHERE `id`='2'
---
    public function loadEmpresa($empresa_id)
    {
        if (($model = Empresa::findOne($empresa_id)) !== null) {

SELECT * FROM `pedido` WHERE `id`='1'
---
    public function loadpedido($pedido_id)
    {
        if (($model = Pedido::findOne($pedido_id)) !== null) {