backend/controllers/ComprasController.php

SELECT * FROM `compras` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Compras::findOne($id)) !== null) {