backend/controllers/EmpresaController.php

SELECT * FROM `empresa` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Empresa::findOne($id)) !== null) {