backend/controllers/PerfilController.php

SELECT * FROM `perfil` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Perfil::findOne($id)) !== null) {