frontend/controllers/PerfilController.php

    protected function findModel($id)
    {
        if (($model = Perfil::findOne($id)) !== null) {
---
SELECT * FROM `perfil` WHERE `id`='1'