common/models/ValorHelpers.php

SELECT * FROM `rol` WHERE `rol_nombre`='Admin'
---
    public static function getRolValor($rol_nombre)
    {
        $rol = Rol::find('rol_valor')
            ->where(['rol_nombre' => $rol_nombre])
            ->one();

SELECT * FROM `rol` WHERE `rol_nombre`='Admin'
---
    public static function esRolNombreValido($rol_nombre)
    {
        $rol = Rol::find('rol_nombre')
            ->where(['rol_nombre' => $rol_nombre])
            ->one();

SELECT * FROM `estado` WHERE `estado_nombre`='Activo'
---
    public static function getEstadoId($estado_nombre)
    {
        $estado = Estado::find('id')
            ->where(['estado_nombre' => $estado_nombre])
            ->one();